app/controllers/character_controller.rb

INSERT INTO "characters" ("team", "unit") VALUES (?, ?)  [["team", 1], ["unit", "Knight"]]
---
  def add_knight
    Character.create(unit: 'knight',team: 1)

INSERT INTO "characters" ("team", "unit") VALUES (?, ?)  [["team", 1], ["unit", "mage"]]
---
  def add_mage
    Character.create(unit: 'mage',team: 1)

INSERT INTO "characters" ("team", "unit") VALUES (?, ?)  [["team", 2], ["unit", "medusa"]]
---
  def add_medusa
    Character.create(unit: 'medusa',team: 2)

INSERT INTO "characters" ("team", "unit") VALUES (?, ?)  [["team", 2], ["unit", "jinn"]]
---
  def add_jinn
    Character.create(unit: 'jinn',team: 2)