app/models/character.rb

SELECT "characters".* FROM "characters" WHERE "characters"."team" = ? AND "characters"."unit" = ?  [["team", 1], ["unit", "mage"]]
INSERT INTO "characters" ("team", "unit") VALUES (?, ?)  [["team", 1], ["unit", "knight"]]
---
  def self.team_one_ultimate
    if Character.where(team: 1, unit: 'mage').length >=2 and Character.where(team: 1, unit: 'knight').length >=2
      5.times do
        Character.create(unit:'knight',team: 1)

SELECT "characters".* FROM "characters" WHERE "characters"."team" = ? AND "characters"."unit" = ?  [["team", 2], ["unit", "medusa"]]
SELECT "characters".* FROM "characters" WHERE "characters"."team" = ?  [["team", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 59]]
---
  def self.team_two_ultimate
    if Character.where(team: 2, unit: 'medusa').length >=1 and Character.where(team: 2, unit: 'jinn').length >=2
      team_1 = Character.where(team:1)
      if team_1.length > 3
        team_1.sample(3).each do |ch|
          ch.delete

SELECT "characters".* FROM "characters" WHERE "characters"."team" = ?  [["team", 2]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 35]]
---
  def self.default_team_one_attack
    if rand(0..1).zero?
      team_2 = Character.where(team:2)
      team_2.sample(1).each do |ch|
        ch.delete

SELECT "characters".* FROM "characters" WHERE "characters"."team" = ?  [["team", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 58]]
---
  def self.default_team_two_attack
    if rand(0..1).zero?
      team_2 = Character.where(team:1)
      team_2.sample(1).each do |ch|
        ch.delete